In [1]:
import pandas as pd

# Series

In [3]:
list_data = [1, 2, 3, 4, 5]
list_index = ['a', 'b', 'c', 'd', 'e']
example_obj = pd.Series(data=list_data, index=list_index)

In [4]:
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [5]:
example_obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [6]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
example_obj["a"]

1

In [8]:
example_obj[example_obj > 2]

c    3
d    4
e    5
dtype: int64

In [10]:
example_obj.to_dict()

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [13]:
dict_data = {'a':1, "b":2, 'c':3, 'd':4, 'e':5}
indexes = ["a", "b", "c", "d", "e", "f"]
series_obj = pd.Series(dict_data, index=indexes)
series_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
dtype: float64

# Dataframe

In [24]:
import numpy as np
s = pd.Series(np.nan, index=[50, 49, 48, 1, 2, 3, 4, 5])
s.loc[:3] # index일

50   NaN
49   NaN
48   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [25]:
s.iloc[:3]

50   NaN
49   NaN
48   NaN
dtype: float64

In [26]:
df = pd.read_csv('train.csv')

In [29]:
df.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [39]:
df['test'] = 0

In [40]:
df.test = df.Age > 40

In [41]:
df['test'].head()

0    0
1    0
2    0
3    0
4    0
Name: test, dtype: int64

In [42]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,881,882,883,884,885,886,887,888,889,890
PassengerId,1,2,3,4,5,6,7,8,9,10,...,882,883,884,885,886,887,888,889,890,891
Survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male
Age,22,38,26,35,35,NaN,54,2,27,14,...,33,22,28,25,39,27,19,NaN,26,32
SibSp,1,1,0,1,0,0,0,3,0,1,...,0,0,0,0,0,0,0,1,0,0
Parch,0,0,0,0,0,0,0,1,2,0,...,0,0,0,0,5,0,0,2,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,113803,373450,330877,17463,349909,347742,237736,...,349257,7552,C.A./SOTON 34068,SOTON/OQ 392076,382652,211536,112053,W./C. 6607,111369,370376
Fare,7.25,71.2833,7.925,53.1,8.05,8.4583,51.8625,21.075,11.1333,30.0708,...,7.8958,10.5167,10.5,7.05,29.125,13,30,23.45,30,7.75
Cabin,NaN,C85,NaN,C123,NaN,NaN,E46,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,B42,NaN,C148,NaN
Embarked,S,C,S,S,S,Q,S,S,S,C,...,S,S,S,S,Q,S,S,S,C,Q
test,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [43]:
del df['test']